app/Controllers/DashController.php

SELECT `product`.`id_product`, `product`.`nama_product`, `img_product`, `kategori_product`.`nama_kategori`, `kategori_product`.`id_kategori`
FROM `product`
JOIN `kategori_product` ON `kategori_product`.`id_kategori` = `product`.`id_kategori`
ORDER BY `kategori_product`.`id_kategori` ASC
---
    public function productadd(){

        if (!session()->get('isLoggedIn')) {
            // Jika belum login, redirect ke halaman login
            return redirect()->to('auth')->with('error', 'Akses Anda Ditolak !');
        }

        $productmodel = new ProductModel();
        $kategoriModel = new KategoriModel();

        $data['product'] = $productmodel
        ->select('product.id_product, product.nama_product, img_product, kategori_product.nama_kategori, kategori_product.id_kategori')
        ->join('kategori_product', 'kategori_product.id_kategori = product.id_kategori',)
        ->orderBy('kategori_product.id_kategori','ASC')
        ->findAll();