app/Controllers/DashController.php

    public function productadd()
    {

        if (!session()->get('isLoggedIn')) {
            // Jika belum login, redirect ke halaman login
            return redirect()->to('auth')->with('error', 'Akses Anda Ditolak !');
        }

        $productmodel = new ProductModel();
        $kategoriModel = new KategoriModel();

        $data['product'] = $productmodel
            ->select('product.id_product, product.nama_product, img_product, kategori_product.nama_kategori, kategori_product.id_kategori')
            ->join('kategori_product', 'kategori_product.id_kategori = product.id_kategori',)
            ->orderBy('kategori_product.id_kategori', 'ASC')
            ->findAll();
---
SELECT `product`.`id_product`, `product`.`nama_product`, `img_product`, `kategori_product`.`nama_kategori`, `kategori_product`.`id_kategori`
FROM `product`
JOIN `kategori_product` ON `kategori_product`.`id_kategori` = `product`.`id_kategori`
ORDER BY `kategori_product`.`id_kategori` ASC

                //     print_r($data);

                // Simpan data kategori ke database
                if ($clientmodel->insert($data)) {
---
INSERT INTO `client` (`id_client`, `nama_client`, `img_client`) VALUES ('21', 'ASPEX KUMBONG', 'aspexkumbong.jpg')

    public function hapusclient($id_client)
    {

        if (!session()->get('isLoggedIn')) {
            // Jika belum login, redirect ke halaman login
            return redirect()->to('auth')->with('error', 'Akses Anda Ditolak !');
        }



        $clientmodel = new ClientModel();
        $client = $clientmodel->find($id_client);
---
SELECT *
FROM `client`
WHERE `client`.`id_client` = '15'