app/Controllers/KaryawanController.php

SELECT *
FROM `absensi`
WHERE `id_karyawan` = '1'
AND `tanggal` = '2024-10-25'
 LIMIT 1
---
    public function hadir($id_karyawan)
    {
        if (!session()->get('isLoggedIn')) {
            // Jika belum login, redirect ke halaman login
            return redirect()->to('auth')->with('error', 'Akses Anda Ditolak !');
        }

        $model = new KaryawanModel();
        $modelabsen = new AbsensiModel();

        // Ambil tanggal hari ini
        $tanggal = date('Y-m-d'); // Format YYYY-MM-DD

        // Cek apakah karyawan sudah hadir hari ini
        $existingAbsence = $modelabsen->where('id_karyawan', $id_karyawan)
            ->where('tanggal', $tanggal)
            ->first();

SELECT *
FROM `absensi`
WHERE `id_karyawan` = '1'
AND `tanggal` = '2024-10-25'
 LIMIT 1
---
    public function izin($id_karyawan)
    {
        if (!session()->get('isLoggedIn')) {
            // Jika belum login, redirect ke halaman login
            return redirect()->to('auth')->with('error', 'Akses Anda Ditolak !');
        }

        $model = new KaryawanModel();
        $modelabsen = new AbsensiModel();

        // Ambil tanggal hari ini
        $tanggal = date('Y-m-d'); // Format YYYY-MM-DD

        // Cek apakah karyawan sudah hadir hari ini
        $existingAbsence = $modelabsen->where('id_karyawan', $id_karyawan)
            ->where('tanggal', $tanggal)
            ->first();

SELECT `absensi`.`id_absensi`, `absensi`.`id_karyawan`, `absensi`.`tanggal`, `karyawan`.`nama_karyawan`, `absensi`.`keterangan`, `lemburan`.`id_lembur`
FROM `absensi`
JOIN `karyawan` ON `karyawan`.`id_karyawan` = `absensi`.`id_karyawan`
LEFT JOIN `lemburan` ON `lemburan`.`id_karyawan` = `absensi`.`id_karyawan` AND `lemburan`.`id_absensi` = `absensi`.`id_absensi`
ORDER BY `absensi`.`tanggal` DESC
---
    public function absensi()
    {

        if (!session()->get('isLoggedIn')) {
            // Jika belum login, redirect ke halaman login
            return redirect()->to('auth')->with('error', 'Akses Anda Ditolak !');
        }

        $tabelkaryawan = new KaryawanModel();
        $tabelabsensi = new AbsensiModel();
        $tabellemburan = new LemburModel();

        $data['tabel'] = $tabelabsensi
            ->select('absensi.id_absensi, absensi.id_karyawan, absensi.tanggal, karyawan.nama_karyawan, absensi.keterangan, lemburan.id_lembur')
            ->join('karyawan', 'karyawan.id_karyawan = absensi.id_karyawan')  // Join tabel karyawan dengan absensi
            ->join('lemburan', 'lemburan.id_karyawan = absensi.id_karyawan AND lemburan.id_absensi = absensi.id_absensi', 'left') // Join lemburan berdasarkan id_karyawan dan id_absensi
            ->orderBy('absensi.tanggal', 'DESC') // Urutkan berdasarkan tanggal absensi
            ->findAll();