app/Models/AbsensiModel.php

SELECT `id_karyawan`
FROM `absensi`
WHERE `id_absensi` = '13'
 LIMIT 1
---
    public function getbyid($id_absensi){

        return $this->select('id_karyawan')->where('id_absensi', $id_absensi)->first();