app/Models/ClientModel.php

    public function getclient()
    {
        return $this->findAll(); // Mengambil semua data kategori
---
SELECT *
FROM `client`

    public function getid(){

        $builder = $this->db->table($this->table);
        $builder->selectMax('id_client');
        $query = $builder->get();
---
SELECT MAX(`id_client`) AS `id_client`
FROM `client`