app/Models/KalModel.php

    public function getTableFieldsCount()
    {

        $data['karyawan'] = $this->db->table('karyawan')->countAllResults();
        $data['Lemburan'] = $this->db->table('Lemburan')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `karyawan`
SELECT COUNT(*) AS `numrows`
FROM `Lemburan`