app/Models/KaryawanModel.php

    public function getkaryawan()
    {
        return $this->findAll(); // Mengambil semua data kategori
---
SELECT *
FROM `karyawan`