app/Models/ProductModel.php

    public function getid(){

        $builder = $this->db->table($this->table);
        $builder->selectMax('id_product');
        $query = $builder->get();
---
SELECT MAX(`id_product`) AS `id_product`
FROM `product`